# Pandas Tutorial

 - Pandas is an open source, BSD Licenced Library prividing high performance, easy to use data structures and data analysis tools for the Python programming Language.

## Agenda
- what is data frames?
- what is data series?
- Different operations in Pandas.

In [1]:
# First step is to import pandas
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame((np.arange(0,20).reshape(5,4)),index=["Row1", "Row2", "Row3", "Row4", "Row5"],columns=["Column1","Column2","Column3","Column4"])

In [3]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [4]:
df.to_csv("Test1.csv")

In [ ]:
#Accessing the elements
1. .loc, 2. .iloc

In [5]:
df.loc["Row1"]

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [6]:
type(df.loc["Row1"])

pandas.core.series.Series

In [7]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [8]:
type(df.iloc[:,:])

pandas.core.frame.DataFrame

In [9]:
df.iloc[0:3,0:3]

      Column1  Column2  Column3
Row1        0        1        2
Row2        4        5        6
Row3        8        9       10

In [10]:
type(df.iloc[0:3,0:3])

pandas.core.frame.DataFrame

In [12]:
df.iloc[0:,0:1]

      Column1
Row1        0
Row2        4
Row3        8
Row4       12
Row5       16

In [13]:
type(df.iloc[0:,0:1])

pandas.core.frame.DataFrame

In [15]:
df.iloc[0:2,0]

Row1    0
Row2    4
Name: Column1, dtype: int32

In [16]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [ ]:
# Converting the Data frames in to the Arrays

In [18]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [17]:
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [19]:
df.iloc[:,:].values.shape

(5, 4)

In [20]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [21]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [23]:
df["Column4"].value_counts()

7     1
19    1
11    1
3     1
15    1
Name: Column4, dtype: int64

In [25]:
df["Column1"].unique()

array([ 0,  4,  8, 12, 16])

In [26]:
df[["Column3", "Column4"]]

      Column3  Column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19